In [10]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

df = pd.read_csv("C:/Users/HP/Downloads/Banking.csv")
df.head(5)

,Client ID,Name,Age,Location ID,Joined Bank,Banking Contact,Nationality,Occupation,Fee Structure,Loyalty Classification,...,Bank Deposits,Checking Accounts,Saving Accounts,Foreign Currency Account,Business Lending,Properties Owned,Risk Weighting,BRId,GenderId,IAId
0,IND81288,Raymond Mills,24,34324,06-05-2019,Anthony Torres,American,Safety Technician IV,High,Jade,...,1485828.64,603617.88,607332.46,12249.96,1134475.30,1,2,1,1,1
1,IND65833,Julia Spencer,23,42205,10-12-2001,Jonathan Hawkins,African,Software Consultant,High,Jade,...,641482.79,229521.37,344635.16,61162.31,2000526.10,1,3,2,1,2
2,IND47499,Stephen Murray,27,7314,25-01-2010,Anthony Berry,European,Help Desk Operator,High,Gold,...,1033401.59,652674.69,203054.35,79071.78,548137.58,1,3,3,2,3
3,IND72498,Virginia Garza,40,34594,28-03-2019,Steve Diaz,American,Geologist II,Mid,Silver,...,1048157.49,1048157.49,234685.02,57513.65,1148402.29,0,4,4,1,4
4,IND60181,Melissa Sanders,46,41269,20-07-2012,Shawn Long,American,Assistant Professor,Mid,Platinum,...,487782.53,446644.25,128351.45,30012.14,1674412.12,0,3,1,2,5

In [11]:
pip install psycopg2-binary sqlalchemy

Requirement already satisfied: psycopg2-binary in c:\cap\lib\site-packages (2.9.11)
Requirement already satisfied: sqlalchemy in c:\cap\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\cap\lib\site-packages (from sqlalchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [7]:
from sqlalchemy import create_engine 
# 1: Connect to postgerys

username = 'postgres'
password = '1k2e3v4i5N'
host = 'localhost'
port = '5432'
database = "banking_cases"

engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

#2 : Load Dataframe into PGAdmin

table_name = "banking_customer"
df.to_sql(table_name , engine , if_exists = "replace", index = False)

print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

Data successfully loaded into table 'banking_customer' in database 'banking_cases'.

In [8]:
# Generate discriptive statistics for the Data frame :

df.describe()

,Age,Location ID,Estimated Income,Superannuation Savings,Amount of Credit Cards,Credit Card Balance,Bank Loans,Bank Deposits,Checking Accounts,Saving Accounts,Foreign Currency Account,Business Lending,Properties Owned,Risk Weighting,BRId,GenderId,IAId
count,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3.000000e+03,3.000000e+03,3.000000e+03,3.000000e+03,3000.000000,3.000000e+03,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000
mean,51.039667,21563.323000,171305.034263,25531.599673,1.463667,3176.206943,5.913862e+05,6.715602e+05,3.210929e+05,2.329084e+05,29883.529993,8.667598e+05,1.518667,2.249333,2.559333,1.504000,10.425333
std,19.854760,12462.273017,111935.808209,16259.950770,0.676387,2497.094709,4.575570e+05,6.457169e+05,2.820796e+05,2.300078e+05,23109.924010,6.412303e+05,1.102145,1.131191,1.007713,0.500067,5.988242
min,17.000000,12.000000,15919.480000,1482.030000,1.000000,1.170000,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,45.000000,0.000000e+00,0.000000,1.000000,1.000000,1.000000,1.000000
25%,34.000000,10803.500000,82906.595000,12513.775000,1.000000,1236.630000,2.396281e+05,2.044004e+05,1.199475e+05,7.479440e+04,11916.542500,3.748251e+05,1.000000,1.000000,2.000000,1.000000,5.000000
50%,51.000000,21129.500000,142313.480000,22357.355000,1.000000,2560.805000,4.797934e+05,4.633165e+05,2.428157e+05,1.640866e+05,24341.190000,7.113147e+05,2.000000,2.000000,3.000000,2.000000,10.000000
75%,69.000000,32054.500000,242290.305000,35464.740000,2.000000,4522.632500,8.258130e+05,9.427546e+05,4.348749e+05,3.155750e+05,41966.392500,1.185110e+06,2.000000,3.000000,3.000000,2.000000,15.000000
max,85.000000,43369.000000,522330.260000,75963.900000,3.000000,13991.990000,2.667557e+06,3.890598e+06,1.969923e+06,1.724118e+06,124704.870000,3.825962e+06,3.000000,5.000000,4.000000,2.000000,22.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 25 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Client ID                 3000 non-null   object
 1   Name                      3000 non-null   object
 2   Age                       3000 non-null   int64
 3   Location ID               3000 non-null   int64
 4   Joined Bank               3000 non-null   object
 5   Banking Contact           3000 non-null   object
 6   Nationality               3000 non-null   object
 7   Occupation                3000 non-null   object
 8   Fee Structure             3000 non-null   object
 9   Loyalty Classification    3000 non-null   object
 10  Estimated Income          3000 non-null   float64
 11  Superannuation Savings    3000 non-null   float64
 12  Amount of Credit Cards    3000 non-null   int64
 13  Credit Card Balance       3000 non-null   float64
 14  Bank Loans                3000 non-null   float64
 15  Bank Deposits             3000 non-null   float64
 16  Checking Accounts         3000 non-null   float64
 17  Saving Accounts           3000 non-null   float64
 18  Foreign Currency Account  3000 non-null   float64
 19  Business Lending          3000 non-null   float64
 20  Properties Owned          3000 non-null   int64
 21  Risk Weighting            3000 non-null   int64
 22  BRId                      3000 non-null   int64
 23  GenderId                  3000 non-null   int64
 24  IAId                      3000 non-null   int64
dtypes: float64(9), int64(8), object(8)
memory usage: 586.1+ KB

In [12]:
df.columns

Index(['Client ID', 'Name', 'Age', 'Location ID', 'Joined Bank',
       'Banking Contact', 'Nationality', 'Occupation', 'Fee Structure',
       'Loyalty Classification', 'Estimated Income', 'Superannuation Savings',
       'Amount of Credit Cards', 'Credit Card Balance', 'Bank Loans',
       'Bank Deposits', 'Checking Accounts', 'Saving Accounts',
       'Foreign Currency Account', 'Business Lending', 'Properties Owned',
       'Risk Weighting', 'BRId', 'GenderId', 'IAId'],
      dtype='object')

In [13]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')

In [14]:
df.columns

Index(['client_id', 'name', 'age', 'location_id', 'joined_bank',
       'banking_contact', 'nationality', 'occupation', 'fee_structure',
       'loyalty_classification', 'estimated_income', 'superannuation_savings',
       'amount_of_credit_cards', 'credit_card_balance', 'bank_loans',
       'bank_deposits', 'checking_accounts', 'saving_accounts',
       'foreign_currency_account', 'business_lending', 'properties_owned',
       'risk_weighting', 'brid', 'genderid', 'iaid'],
      dtype='object')

In [20]:
# freqency mapping for gender
ferquency_mapping = {
    
    1 : 'male',
    2 : 'female'
}

df['gender'] = df['genderid'].map(ferquency_mapping)

In [21]:
df[['gender','genderid']].head(5)

   gender  genderid
0    male         1
1    male         1
2  female         2
3    male         1
4  female         2

In [23]:
# frequency mapping for IAID 

ferquency_mapping1 = {
    
    1 : 'Victor_Dean',
    2 : 'Jeremy_Potter',
    3 : 'Emest_Knight',
    4 : 'Eric_shaw',
    5 : 'Kevin_kim',
    6 : 'Victor_Roger',
    7 : 'Eugene_Cunninghan',
    8 : 'joe_carroll',
    9 : 'Steve_Sanchez',
    10 : 'Lawrence_Sanchez',
    11 : 'Peter_Castillo',
    12 : 'Victor_gutlierrez',
    13 : 'Daniel_Carroll',
    14 : 'Carl_Anderson',
    15 : 'Nicholas_Ward',
    16 : 'Fred_Bryant',
    17 : 'Ryan_Taylor',
    18 : 'Sean_Vasquez',
    19 : 'Nicholas_Morrison',
    20 : 'Jack_Phillips',
    21 : 'Juan_Ramirez',
    22 : 'Gregory_boyd'
}

df['ivestment_advisor'] = df['iaid'].map(ferquency_mapping1)

In [25]:
df[['iaid' , 'ivestment_advisor']].tail(10)

      iaid  ivestment_advisor
2990    14      Carl_Anderson
2991    15      Nicholas_Ward
2992     1        Victor_Dean
2993     2      Jeremy_Potter
2994     3       Emest_Knight
2995     4          Eric_shaw
2996     5          Kevin_kim
2997     6       Victor_Roger
2998     7  Eugene_Cunninghan
2999     8        joe_carroll

In [29]:
# frequency mapping for Banking_Relationship

ferquency_mapping2 = {
    1 : 'Retail',
    2 : 'Institutional',
    3 : 'Pricvate_Bank',
    4 : 'Commercial'
}

df['banking_relationship'] = df['brid'].map(ferquency_mapping2)

In [30]:
df[['brid' , 'banking_relationship']].head(10)

   brid banking_relationship
0     1               Retail
1     2        Institutional
2     3        Pricvate_Bank
3     4           Commercial
4     1               Retail
5     1               Retail
6     1               Retail
7     2        Institutional
8     2        Institutional
9     3        Pricvate_Bank

In [33]:
df.head(5)

,client_id,name,age,location_id,joined_bank,banking_contact,nationality,occupation,fee_structure,loyalty_classification,...,foreign_currency_account,business_lending,properties_owned,risk_weighting,brid,genderid,iaid,gender,ivestment_advisor,banking_relationship
0,IND81288,Raymond Mills,24,34324,06-05-2019,Anthony Torres,American,Safety Technician IV,High,Jade,...,12249.96,1134475.30,1,2,1,1,1,male,Victor_Dean,Retail
1,IND65833,Julia Spencer,23,42205,10-12-2001,Jonathan Hawkins,African,Software Consultant,High,Jade,...,61162.31,2000526.10,1,3,2,1,2,male,Jeremy_Potter,Institutional
2,IND47499,Stephen Murray,27,7314,25-01-2010,Anthony Berry,European,Help Desk Operator,High,Gold,...,79071.78,548137.58,1,3,3,2,3,female,Emest_Knight,Pricvate_Bank
3,IND72498,Virginia Garza,40,34594,28-03-2019,Steve Diaz,American,Geologist II,Mid,Silver,...,57513.65,1148402.29,0,4,4,1,4,male,Eric_shaw,Commercial
4,IND60181,Melissa Sanders,46,41269,20-07-2012,Shawn Long,American,Assistant Professor,Mid,Platinum,...,30012.14,1674412.12,0,3,1,2,5,female,Kevin_kim,Retail

In [34]:
df = df.drop('brid' , axis = 1)
df = df.drop('genderid' , axis = 1)
df = df.drop('iaid' , axis = 1)

In [35]:
df.head(5)

,client_id,name,age,location_id,joined_bank,banking_contact,nationality,occupation,fee_structure,loyalty_classification,...,bank_deposits,checking_accounts,saving_accounts,foreign_currency_account,business_lending,properties_owned,risk_weighting,gender,ivestment_advisor,banking_relationship
0,IND81288,Raymond Mills,24,34324,06-05-2019,Anthony Torres,American,Safety Technician IV,High,Jade,...,1485828.64,603617.88,607332.46,12249.96,1134475.30,1,2,male,Victor_Dean,Retail
1,IND65833,Julia Spencer,23,42205,10-12-2001,Jonathan Hawkins,African,Software Consultant,High,Jade,...,641482.79,229521.37,344635.16,61162.31,2000526.10,1,3,male,Jeremy_Potter,Institutional
2,IND47499,Stephen Murray,27,7314,25-01-2010,Anthony Berry,European,Help Desk Operator,High,Gold,...,1033401.59,652674.69,203054.35,79071.78,548137.58,1,3,female,Emest_Knight,Pricvate_Bank
3,IND72498,Virginia Garza,40,34594,28-03-2019,Steve Diaz,American,Geologist II,Mid,Silver,...,1048157.49,1048157.49,234685.02,57513.65,1148402.29,0,4,male,Eric_shaw,Commercial
4,IND60181,Melissa Sanders,46,41269,20-07-2012,Shawn Long,American,Assistant Professor,Mid,Platinum,...,487782.53,446644.25,128351.45,30012.14,1674412.12,0,3,female,Kevin_kim,Retail

In [38]:
# frequency mapping for risk_weighting

ferquency_mapping3 = {
    1 : 'Very_Low_Risk',
    2 : 'Low_Risk',
    3 : 'Medium_Risk',
    4 : 'High_Risk',
    5 : 'Very_High_Risk'
}

df['risk_sensitivity'] = df['risk_weighting'].map(ferquency_mapping3)

In [41]:
df[['risk_weighting' , 'risk_sensitivity']].head(5)

   risk_weighting risk_sensitivity
0               2         Low_Risk
1               3      Medium_Risk
2               3      Medium_Risk
3               4        High_Risk
4               3      Medium_Risk

In [42]:
df = df.drop('risk_weighting' , axis = 1)

In [43]:
df.head()

,client_id,name,age,location_id,joined_bank,banking_contact,nationality,occupation,fee_structure,loyalty_classification,...,bank_deposits,checking_accounts,saving_accounts,foreign_currency_account,business_lending,properties_owned,gender,ivestment_advisor,banking_relationship,risk_sensitivity
0,IND81288,Raymond Mills,24,34324,06-05-2019,Anthony Torres,American,Safety Technician IV,High,Jade,...,1485828.64,603617.88,607332.46,12249.96,1134475.30,1,male,Victor_Dean,Retail,Low_Risk
1,IND65833,Julia Spencer,23,42205,10-12-2001,Jonathan Hawkins,African,Software Consultant,High,Jade,...,641482.79,229521.37,344635.16,61162.31,2000526.10,1,male,Jeremy_Potter,Institutional,Medium_Risk
2,IND47499,Stephen Murray,27,7314,25-01-2010,Anthony Berry,European,Help Desk Operator,High,Gold,...,1033401.59,652674.69,203054.35,79071.78,548137.58,1,female,Emest_Knight,Pricvate_Bank,Medium_Risk
3,IND72498,Virginia Garza,40,34594,28-03-2019,Steve Diaz,American,Geologist II,Mid,Silver,...,1048157.49,1048157.49,234685.02,57513.65,1148402.29,0,male,Eric_shaw,Commercial,High_Risk
4,IND60181,Melissa Sanders,46,41269,20-07-2012,Shawn Long,American,Assistant Professor,Mid,Platinum,...,487782.53,446644.25,128351.45,30012.14,1674412.12,0,female,Kevin_kim,Retail,Medium_Risk

In [44]:
from sqlalchemy import create_engine 
# 1: Connect to postgerys

username = 'postgres'
password = '1k2e3v4i5N'
host = 'localhost'
port = '5432'
database = "banking_cases"

engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

#2 : Load Dataframe into PGAdmin

table_name = "banking_customer"
df.to_sql(table_name , engine , if_exists = "replace", index = False)

print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

Data successfully loaded into table 'banking_customer' in database 'banking_cases'.

In [37]:
df['risk_weighting'].value_counts()

risk_weighting
2    1222
1     836
3     460
4     322
5     160
Name: count, dtype: int64

In [45]:
df['loyalty_classification'].unique()

array(['Jade', 'Gold', 'Silver', 'Platinum'], dtype=object)

In [46]:
df['loyalty_classification'].value_counts()

loyalty_classification
Jade        1331
Silver       767
Gold         585
Platinum     317
Name: count, dtype: int64